/*
 * Ітерація по масиву
 *
 * - Ітерація по масиву циклом for
 * - Цикл for...of
 * - Різниця у використанні for и for...of
 */

// const friends = ['Mango', 'Kiwi', 'Poly', 'Ajax'];

// console.log(friends);

//~ Через цикл for

//~ Через цикл for...of

/*
TODO: Напиши скрипт для перебора масиву fruits.
TODO: Для кожного елемента масиву виведи в консоль рядок
TODO: у форматі номер_елемента: значення_елемента.
TODO: Нумерація елементів повинна починатися з 1.
*/

// const fruits = ['🍎', '🍇', '🍑', '🍌', '🍋'];

// console.log(fruits);
